### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dev.google_app_engine_standard_app_version.fmltc-app-v1 will be updated in-place
!   resource "google_app_engine_standard_app_version" "fmltc-app-v1" {
        id                        = "apps/ftc-ml-firstinspires-dev/services/default/versions/v1"
        name                      = "apps/ftc-ml-firstinspires-dev/services/default/versions/v1"
        # (9 unchanged attributes hidden)

!       automatic_scaling {
!           min_pending_latency     = "0.100s" -> "0.1s"
            # (4 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

!       deployment {

!           zip {
!               source_url  = "https://storage.googleapis.com/ftc-ml-firstinspires-dev-gae-source/c8db84ae9bb40fdb12edeba1b15761d3.zip" -> "https://storage.googleapis.com/ftc-ml-firstinspires-dev-gae-source/ae31b18d4d71c824e3e60eec731e9897.zip"
                # (1 unchanged attribute hidden)
            }
        }


-       handlers {
-           auth_fail_action = "AUTH_FAIL_ACTION_REDIRECT" -> null
-           login            = "LOGIN_OPTIONAL" -> null
-           security_level   = "SECURE_OPTIONAL" -> null
-           url_regex        = ".*" -> null

-           script {
-               script_path = "auto" -> null
            }
        }


        # (8 unchanged blocks hidden)
    }

  # module.dev.google_cloudfunctions_function.perform-action will be updated in-place
!   resource "google_cloudfunctions_function" "perform-action" {
        id                    = "projects/ftc-ml-firstinspires-dev/locations/us-central1/functions/perform_action"
        name                  = "perform_action"
!       source_archive_object = "f5307ba01fb258b66ce54a1dda33228e.zip" -> "3ecca2abf88116f75708112e5b0b66dc.zip"
        # (13 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.dev.google_datastore_index.endOfSeason1 will be created
+   resource "google_datastore_index" "endOfSeason1" {
+       ancestor = "NONE"
+       id       = (known after apply)
+       index_id = (known after apply)
+       kind     = "EndOfSeason"
+       project  = (known after apply)

+       properties {
+           direction = "ASCENDING"
+           name      = "season"
        }
+       properties {
+           direction = "ASCENDING"
+           name      = "program"
        }
+       properties {
+           direction = "ASCENDING"
+           name      = "team_number"
        }
    }

  # module.dev.google_storage_bucket_object.app-server-archive must be replaced
-/+ resource "google_storage_bucket_object" "app-server-archive" {
!       content_type     = "application/zip" -> (known after apply)
!       crc32c           = "pNDDpg==" -> (known after apply)
!       detect_md5hash   = "yNuErpu0D9sS7euhsVdh0w==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "ftc-ml-firstinspires-dev-gae-source-c8db84ae9bb40fdb12edeba1b15761d3.zip" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "yNuErpu0D9sS7euhsVdh0w==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/ftc-ml-firstinspires-dev-gae-source/o/c8db84ae9bb40fdb12edeba1b15761d3.zip?generation=1662654421159707&alt=media" -> (known after apply)
-       metadata         = {} -> null
!       name             = "c8db84ae9bb40fdb12edeba1b15761d3.zip" -> "ae31b18d4d71c824e3e60eec731e9897.zip" # forces replacement
!       output_name      = "c8db84ae9bb40fdb12edeba1b15761d3.zip" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/ftc-ml-firstinspires-dev-gae-source/o/c8db84ae9bb40fdb12edeba1b15761d3.zip" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.closure_js must be replaced
-/+ resource "google_storage_bucket_object" "closure_js" {
!       crc32c           = "dXtlXg==" -> (known after apply)
!       detect_md5hash   = "9jlHl3OsxRFQF8nBoHClvw==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "ftc-ml-firstinspires-dev-compiled/js/fmltc.js" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "9jlHl3OsxRFQF8nBoHClvw==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/ftc-ml-firstinspires-dev/o/compiled%2Fjs%2Ffmltc.js?generation=1662654421128980&alt=media" -> (known after apply)
-       metadata         = {} -> null
        name             = "compiled/js/fmltc.js"
!       output_name      = "compiled/js/fmltc.js" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/ftc-ml-firstinspires-dev/o/compiled%2Fjs%2Ffmltc.js" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (3 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.cloud-function-archive must be replaced
-/+ resource "google_storage_bucket_object" "cloud-function-archive" {
!       content_type     = "application/zip" -> (known after apply)
!       crc32c           = "WPA4dg==" -> (known after apply)
!       detect_md5hash   = "9TB7oB+yWLZs5Uod2jMijg==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "ftc-ml-firstinspires-dev-gcf-source-f5307ba01fb258b66ce54a1dda33228e.zip" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "9TB7oB+yWLZs5Uod2jMijg==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/ftc-ml-firstinspires-dev-gcf-source/o/f5307ba01fb258b66ce54a1dda33228e.zip?generation=1662654421163715&alt=media" -> (known after apply)
-       metadata         = {} -> null
!       name             = "f5307ba01fb258b66ce54a1dda33228e.zip" -> "3ecca2abf88116f75708112e5b0b66dc.zip" # forces replacement
!       output_name      = "f5307ba01fb258b66ce54a1dda33228e.zip" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/ftc-ml-firstinspires-dev-gcf-source/o/f5307ba01fb258b66ce54a1dda33228e.zip" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.styles must be replaced
-/+ resource "google_storage_bucket_object" "styles" {
!       crc32c           = "IPWqSQ==" -> (known after apply)
!       detect_md5hash   = "bsHCc4ONTsokCBLXDSfGtA==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "ftc-ml-firstinspires-dev-static/css/styles.css" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "bsHCc4ONTsokCBLXDSfGtA==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/ftc-ml-firstinspires-dev/o/static%2Fcss%2Fstyles.css?generation=1642532565757712&alt=media" -> (known after apply)
-       metadata         = {} -> null
        name             = "static/css/styles.css"
!       output_name      = "static/css/styles.css" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/ftc-ml-firstinspires-dev/o/static%2Fcss%2Fstyles.css" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (3 unchanged attributes hidden)
    }

  # module.dev.module.serverless-connector.google_vpc_access_connector.connector_beta["central-serverless"] must be replaced
-/+ resource "google_vpc_access_connector" "connector_beta" {
!       id             = "projects/ftc-ml-firstinspires-dev/locations/us-central1/connectors/central-serverless" -> (known after apply)
!       max_instances  = 7 -> (known after apply)
!       min_instances  = 2 -> (known after apply)
        name           = "central-serverless"
-       network        = "ml-redis-vpc-dev" -> null # forces replacement
!       self_link      = "projects/ftc-ml-firstinspires-dev/locations/us-central1/connectors/central-serverless" -> (known after apply)
!       state          = "READY" -> (known after apply)
        # (5 unchanged attributes hidden)

!       subnet {
            name       = "serverless-subnet"
!           project_id = "ftc-ml-firstinspires-dev" -> (known after apply)
        }
    }

Plan: 6 to add, 2 to change, 5 to destroy.
```
</details>